app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:title)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."title" ASC

  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @task = Task.new(title: params[:task][:title], description: params[:task][:description], completion_date: params[:task][:completion_date])
    if @task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Play Chess"], ["description", "In the living room with grandpa"], ["created_at", "2018-09-20 01:42:20.863370"], ["updated_at", "2018-09-20 01:42:20.863370"]]

  def edit
    @task = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @task = Task.find_by(id: params[:id].to_i)
    if @task.update(title: params[:task][:title], description: params[:task][:description], completion_date: params[:task][:completion_date])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "Do a jig"], ["completion_date", "Sundays"], ["updated_at", "2018-09-19 22:23:05.055174"], ["id", 2]]

  def destroy
    @task = Task.find_by(id: params[:id].to_i)
    if @task.delete
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]

  def complete
    Task.where(id: params[:id]).update(completion_date: Time.now)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-20 16:52:45.801748"], ["id", 7]]